/*********************************************************************
 * 版权所有: Copyright (c) 2020-2021  XXX Company. All rights reserved.
 * 系统名称: 
 * 文件名称: cc.h
 * 内容摘要: 有关变量类型的定义，NXP官方SDK的一些移植文件会用到
 * 当前版本: 
 * 作    者: HJWang
 * 设计日期: 2020-09-10 21:56
 * 修改记录: 
 * 日    期          版    本          修改人          修改摘要
**********************************************************************/




#ifndef __CC_H__
#define __CC_H__
/********************************** 其它条件编译选项 ***********************************/


/********************************** 标准库头文件 ***********************************/
//#include <xxx.h>


/********************************** 非标准库头文件 ***********************************/
//#include "xxx.h"


/********************************** 常量定义 ***********************************/


/********************************** 全局宏 ***********************************/


/********************************** 数据类型 ***********************************/


/********************************** 函数声明 ***********************************/


/********************************** 类定义 ***********************************/


/********************************** 模板 ***********************************/


#define		__I 				volatile
#define		__O					volatile
#define		__IO				volatile

typedef		signed char			int8_t;
typedef		signed short int	int16_t;
typedef		signed int			int32_t;

typedef		unsigned char		uint8_t;
typedef		unsigned short int	uint16_t;
typedef		unsigned int		uint32_t;

typedef		signed char			s8;
typedef		signed short int	s16;
typedef		signed int			s32;

typedef		unsigned char		u8;
typedef		unsigned short int	u16;
typedef		unsigned int		u32;



#endif /* __CC_H__ */


