/*********************************************************************
 * 版权所有: Copyright (c) 2020-2021  XXX Company. All rights reserved.
 * 系统名称: 
 * 文件名称: int.h
 * 内容摘要: 简要描述本文件的内容，包括主要模块、函数及其功能的说明
 * 当前版本: 
 * 作    者: HJWang
 * 设计日期: 2020-09-19 20:51
 * 修改记录: 
 * 日    期          版    本          修改人          修改摘要
**********************************************************************/




#ifndef __INT_H__
#define __INT_H__
/********************************** 其它条件编译选项 ***********************************/


/********************************** 标准库头文件 ***********************************/
//#include <xxx.h>


/********************************** 非标准库头文件 ***********************************/
//#include "xxx.h"


/********************************** 常量定义 ***********************************/


/********************************** 全局宏 ***********************************/


/********************************** 数据类型 ***********************************/
/*中断处理函数形式*/
typedef void (*system_irq_handler_t)(unsigned int giccIar,
											void *param);

/*中断处理函数结构体*/
typedef struct _sys_irq_handler
{
	system_irq_handler_t irqHandler;			/*中断处理函数*/
	void*userParam;								/*中断函数参数*/
}sys_irq_handle_t;
/********************************** 函数声明 ***********************************/


/********************************** 类定义 ***********************************/


/********************************** 模板 ***********************************/
void int_Init(void);		
void system_irqtable_init(void);
void system_register_irqhandler(IRQn_Type irq,
								system_irq_handler_t handler,
								void *userParam);
void system_irqhandler(unsigned int giccIar);
void default_irqhandler(unsigned int giccIar, void *userParam);

#endif /* __INT_H__ */


